# Ultralytics YOLO 🚀, AGPL-3.0 license
# Phiên bản EDGE (DSC + Low-Rank + Shortcut) cho mô hình GoldAcSim

nc: 80 # Số class của bạn
scales: 
  m: [0.67, 0.75, 768] # Giữ nguyên scale để kế thừa bộ khung

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]       # 0: Stem bóp từ 64 -> 32
  
  # === STAGE 1 ===
  - [-1, 1, DSC, [64, 3, 2]]       # 1: Downsample
  - [-1, 3, C2f_DSC_LR, [64, True, 17]]  # 2: Trích xuất đặc trưng với Rank r=17
  
  # === STAGE 2 ===
  - [-1, 1, DSC, [128, 3, 2]]      # 3: Downsample
  - [-1, 6, C2f_DSC_LR, [128, True, 32]] # 4: Rank r=32
  
  # === STAGE 3 ===
  - [-1, 1, DSC, [256, 3, 2]]      # 5: Downsample
  - [-1, 6, C2f_DSC_LR, [256, True, 64]] # 6: Rank r=64
  
  # === STAGE 4 ===
  - [-1, 1, DSC, [512, 3, 2]]      # 7: Downsample
  - [-1, 3, C2f_DSC_LR, [512, True, 128]] # 8: Rank r=128
  
  - [-1, 1, SimSPPF, [512, 5]]      # 9
  - [-1, 1, SimAM, [512]]       # 10: Nén cổ chai 1x1 trước khi vào head

head:
  - [[2, 4, 6, 10], 1, SimFusion_4in, []] # 11
  - [-1, 1, IFM, [[64, 32]]]             # 12

  # Nén cổ chai 1x1 bằng Low-Rank (rank_ratio = 4)
  - [10, 1, Conv_LR, [512, 4]]            # 13
  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 14
  - [[-1, 12], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 15
  
  # Giữ nguyên C3Ghost vì nó đã là kỹ thuật nén tốt rồi
  - [-1, 3, C3Ghost, [512, False]]       # 16

  # Nén cổ chai 1x1 tiếp theo
  - [6, 1, Conv_LR, [256, 4]]            # 17
  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 18
  - [[-1, 12], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 19
  - [-1, 3, C3Ghost, [256, False]]       # 20

  - [[20, 16, 10], 1, PyramidPoolAgg, [352, 2]] # 21
  - [-1, 1, TopBasicLayer, [352, [64, 128]]]   # 22

  - [[20, 17], 1, AdvPoolFusion, []]           # 23
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 24
  - [-1, 3, C3Ghost, [256, False]]             # 25

  - [[-1, 13], 1, AdvPoolFusion, []]           # 26
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]] # 27
  
  # Chốt chặn cuối cùng bằng C2f siêu nén (Rank r=128)
  - [-1, 3, C2f_DSC_LR, [512, False, 128]]     # 28

  - [[20, 25, 28], 1, Detect, [nc]] # Detect(P3, P4, P5)